# п.2 Створіть програму, яка емулює роботу сервісу зі скорочення посилань.
# Повинна бути реалізована можливість введення початкового посилання та короткої назви
# і отримання початкового посилання за її назвою.
link = {}
while True:
    answer = input("Для того щоб ввести посилання введіть 1. Для отримання посилання введіть 2: \n")
    if answer == "1":
        new_name_link = input("Введіть коротку назву посилання: ")
        new_link = input("Введіть посилання: ")

        link[new_name_link] = new_link
        print(link.items())

    elif answer == "2":
        for key in link.keys():
            print(f"Назви: {key}")
        print("*" * 20)
        num = input("Введіть, будь-ласка, назву посилання:  ")
        print(f"Посилання: {link.get(num)}")
    else:
        print("Введіть, будь-ласка 1 або 2")